#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
module.silver-101ed4-team.sysdig_monitor_alert_metric.dev_pltsvc_db_pod_memory: Refreshing state... [id=16115446]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.silver-101ed4-team.sysdig_monitor_alert_metric.dev_pltsvc_app_pod_cpu will be created
  + resource "sysdig_monitor_alert_metric" "dev_pltsvc_app_pod_cpu" {
      + description           = "DEV: Any of Registry App pod is using more than 80% of limited CPU"
      + enabled               = false
      + group_name            = "default"
      + id                    = (known after apply)
      + metric                = "max(max(sysdig_container_cpu_cores_used_percent)) > 80"
      + multiple_alerts_by    = []
      + name                  = "[DEV] Registry App - CPU"
      + notification_channels = [
          + 148742,
        ]
      + scope                 = "kubernetes.cluster.name in (\"silver\") and kube_namespace_name in (\"101ed4-dev\") and kube_workload_name in (\"pltsvc-app\")"
      + severity              = 3
      + team                  = (known after apply)
      + trigger_after_minutes = 60
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.silver-101ed4-team.sysdig_monitor_alert_metric.dev_pltsvc_app_pod_memory will be created
  + resource "sysdig_monitor_alert_metric" "dev_pltsvc_app_pod_memory" {
      + description           = "DEV: Registry app pod is using 90% of the memory limit"
      + enabled               = false
      + group_name            = "default"
      + id                    = (known after apply)
      + metric                = "avg(max(sysdig_container_memory_limit_used_percent)) > 90"
      + multiple_alerts_by    = []
      + name                  = "[DEV] Registry App - Memory"
      + notification_channels = [
          + 148742,
        ]
      + scope                 = "kubernetes.cluster.name in (\"silver\") and kube_namespace_name in (\"101ed4-dev\") and kube_workload_name in (\"pltsvc-app\")"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 60
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.silver-101ed4-team.sysdig_monitor_alert_metric.dev_pltsvc_db_pod_cpu will be created
  + resource "sysdig_monitor_alert_metric" "dev_pltsvc_db_pod_cpu" {
      + description           = "DEV: Any of Registry MongoDB pod is using more than 80% of limited CPU"
      + enabled               = false
      + group_name            = "default"
      + id                    = (known after apply)
      + metric                = "max(max(sysdig_container_cpu_cores_used_percent)) > 80"
      + multiple_alerts_by    = []
      + name                  = "[DEV] Registry MongoDB - CPU"
      + notification_channels = [
          + 148742,
        ]
      + scope                 = "kubernetes.cluster.name in (\"silver\") and kube_namespace_name in (\"101ed4-dev\") and kube_workload_name in (\"pltsvc-mongodb\")"
      + severity              = 3
      + team                  = (known after apply)
      + trigger_after_minutes = 60
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.silver-101ed4-team.sysdig_monitor_alert_metric.dev_pltsvc_db_pod_memory will be updated in-place
  ~ resource "sysdig_monitor_alert_metric" "dev_pltsvc_db_pod_memory" {
      ~ description           = "DEV: Registry mongo pod is using 90% of the memory limit" -> "DEV: Registry MongoDB pod is using 90% of the memory limit"
        id                    = "16115446"
      ~ metric                = "avg(max(sysdig_container_memory_limit_used_percent)) > 90.0" -> "avg(max(sysdig_container_memory_limit_used_percent)) > 90"
        name                  = "[DEV] Registry MongoDB - Memory"
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.silver-101ed4-team.sysdig_monitor_alert_metric.prod_pltsvc_app_pod_cpu will be created
  + resource "sysdig_monitor_alert_metric" "prod_pltsvc_app_pod_cpu" {
      + description           = "Prod: Any of Registry App pod is using more than 80% of limited CPU"
      + enabled               = false
      + group_name            = "default"
      + id                    = (known after apply)
      + metric                = "max(max(sysdig_container_cpu_cores_used_percent)) > 80"
      + multiple_alerts_by    = []
      + name                  = "[Prod] Registry App - CPU"
      + notification_channels = [
          + 148742,
        ]
      + scope                 = "kubernetes.cluster.name in (\"silver\") and kube_namespace_name in (\"101ed4-prod\") and kube_workload_name in (\"pltsvc-app\")"
      + severity              = 1
      + team                  = (known after apply)
      + trigger_after_minutes = 60
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.silver-101ed4-team.sysdig_monitor_alert_metric.prod_pltsvc_app_pod_memory will be created
  + resource "sysdig_monitor_alert_metric" "prod_pltsvc_app_pod_memory" {
      + description           = "Prod: Registry app pod is using 90% of the memory limit"
      + enabled               = false
      + group_name            = "default"
      + id                    = (known after apply)
      + metric                = "avg(max(sysdig_container_memory_limit_used_percent)) > 90"
      + multiple_alerts_by    = []
      + name                  = "[Prod] Registry App - Memory"
      + notification_channels = [
          + 148742,
        ]
      + scope                 = "kubernetes.cluster.name in (\"silver\") and kube_namespace_name in (\"101ed4-prod\") and kube_workload_name in (\"pltsvc-app\")"
      + severity              = 2
      + team                  = (known after apply)
      + trigger_after_minutes = 60
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.silver-101ed4-team.sysdig_monitor_alert_metric.prod_pltsvc_db_pod_cpu will be created
  + resource "sysdig_monitor_alert_metric" "prod_pltsvc_db_pod_cpu" {
      + description           = "Prod: Any of Registry MongoDB pod is using more than 80% of limited CPU"
      + enabled               = false
      + group_name            = "default"
      + id                    = (known after apply)
      + metric                = "max(max(sysdig_container_cpu_cores_used_percent)) > 80"
      + multiple_alerts_by    = []
      + name                  = "[Prod] Registry MongoDB - CPU"
      + notification_channels = [
          + 148742,
        ]
      + scope                 = "kubernetes.cluster.name in (\"silver\") and kube_namespace_name in (\"101ed4-prod\") and kube_workload_name in (\"pltsvc-mongodb\")"
      + severity              = 1
      + team                  = (known after apply)
      + trigger_after_minutes = 60
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.silver-101ed4-team.sysdig_monitor_alert_metric.prod_pltsvc_db_pod_memory will be created
  + resource "sysdig_monitor_alert_metric" "prod_pltsvc_db_pod_memory" {
      + description           = "Prod: Registry MongoDB pod is using 90% of the memory limit"
      + enabled               = false
      + group_name            = "default"
      + id                    = (known after apply)
      + metric                = "avg(max(sysdig_container_memory_limit_used_percent)) > 90"
      + multiple_alerts_by    = []
      + name                  = "[Prod] Registry MongoDB - Memory"
      + notification_channels = [
          + 148742,
        ]
      + scope                 = "kubernetes.cluster.name in (\"silver\") and kube_namespace_name in (\"101ed4-prod\") and kube_workload_name in (\"pltsvc-mongodb\")"
      + severity              = 2
      + team                  = (known after apply)
      + trigger_after_minutes = 60
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.silver-101ed4-team.sysdig_monitor_alert_metric.test_pltsvc_app_pod_cpu will be created
  + resource "sysdig_monitor_alert_metric" "test_pltsvc_app_pod_cpu" {
      + description           = "Test: Any of Registry App pod is using more than 80% of limited CPU"
      + enabled               = false
      + group_name            = "default"
      + id                    = (known after apply)
      + metric                = "max(max(sysdig_container_cpu_cores_used_percent)) > 80"
      + multiple_alerts_by    = []
      + name                  = "[Test] Registry App - CPU"
      + notification_channels = [
          + 148742,
        ]
      + scope                 = "kubernetes.cluster.name in (\"silver\") and kube_namespace_name in (\"101ed4-test\") and kube_workload_name in (\"pltsvc-app\")"
      + severity              = 3
      + team                  = (known after apply)
      + trigger_after_minutes = 60
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.silver-101ed4-team.sysdig_monitor_alert_metric.test_pltsvc_app_pod_memory will be created
  + resource "sysdig_monitor_alert_metric" "test_pltsvc_app_pod_memory" {
      + description           = "Test: Registry app pod is using 90% of the memory limit"
      + enabled               = false
      + group_name            = "default"
      + id                    = (known after apply)
      + metric                = "avg(max(sysdig_container_memory_limit_used_percent)) > 90"
      + multiple_alerts_by    = []
      + name                  = "[Test] Registry App - Memory"
      + notification_channels = [
          + 148742,
        ]
      + scope                 = "kubernetes.cluster.name in (\"silver\") and kube_namespace_name in (\"101ed4-test\") and kube_workload_name in (\"pltsvc-app\")"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 60
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.silver-101ed4-team.sysdig_monitor_alert_metric.test_pltsvc_db_pod_cpu will be created
  + resource "sysdig_monitor_alert_metric" "test_pltsvc_db_pod_cpu" {
      + description           = "Test: Any of Registry MongoDB pod is using more than 80% of limited CPU"
      + enabled               = false
      + group_name            = "default"
      + id                    = (known after apply)
      + metric                = "max(max(sysdig_container_cpu_cores_used_percent)) > 80"
      + multiple_alerts_by    = []
      + name                  = "[Test] Registry MongoDB - CPU"
      + notification_channels = [
          + 148742,
        ]
      + scope                 = "kubernetes.cluster.name in (\"silver\") and kube_namespace_name in (\"101ed4-test\") and kube_workload_name in (\"pltsvc-mongodb\")"
      + severity              = 3
      + team                  = (known after apply)
      + trigger_after_minutes = 60
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

  # module.silver-101ed4-team.sysdig_monitor_alert_metric.test_pltsvc_db_pod_memory will be created
  + resource "sysdig_monitor_alert_metric" "test_pltsvc_db_pod_memory" {
      + description           = "Test: Registry MongoDB pod is using 90% of the memory limit"
      + enabled               = false
      + group_name            = "default"
      + id                    = (known after apply)
      + metric                = "avg(max(sysdig_container_memory_limit_used_percent)) > 90"
      + multiple_alerts_by    = []
      + name                  = "[Test] Registry MongoDB - Memory"
      + notification_channels = [
          + 148742,
        ]
      + scope                 = "kubernetes.cluster.name in (\"silver\") and kube_namespace_name in (\"101ed4-test\") and kube_workload_name in (\"pltsvc-mongodb\")"
      + severity              = 4
      + team                  = (known after apply)
      + trigger_after_minutes = 60
      + version               = (known after apply)

      + custom_notification {
          + title = "{{__alert_name__}} is {{__alert_status__}}"
        }
    }

Plan: 11 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @junminahn, Action: `pull_request`*